app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
			<div class="comment-box">
				<h2 class="comment-count"><%= @post.comments.count %>件コメント</h2>
				<ol>
					<% @post.comments.each do |commnet| %>