app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 5], ["created_at", "2019-07-22 04:41:49.099641"], ["updated_at", "2019-07-22 04:41:49.099641"]]
---
	def create
        post = Post.find(params[:post_id])
        favorite = current_user.favorite.new(post_id: post.id)
        favorite.save