app/controllers/posts_controller.rb

    def random
        @posts = Post.all.order("RANDOM()")
---
SELECT "posts".* FROM "posts" ORDER BY RANDOM()

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("user_id", "post_image_id", "title", "appeal", "recommend", "cost", "charm", "created_at", "updated_at", "keyword", "genre") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "post_image_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post_image_id", "dbd87ee25e3638c8279258acd000867ba605b87929b3784cc1860d46e305"], ["updated_at", "2019-07-21 02:13:21.483750"], ["id", 1]]

    def art
        @posts = Post.where(genre: 2).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 2]]

    def craft
        @posts = Post.where(genre: 3).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 3]]

    def life
        @posts = Post.where(genre: 1).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 1]]

    def motion
        @posts = Post.where(genre: 0).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 0]]

    def study
        @posts = Post.where(genre: 4).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 4]]

    def other
        @posts = Post.where(genre: 5).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = ? ORDER BY "posts"."created_at" DESC  [["genre", 5]]