app/controllers/posts_controller.rb

    def index
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY desc()